trade_exp/src/Documents/РасходныйОрдерНаТовары/РасходныйОрдерНаТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e5b57481-c7d7-459c-8f38-003976928dcf">
  <name>РасходныйОрдерНаТовары</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.ДвижениеМаркированногоТовара</registerRecords>
  <attributes extendedConfigurationObject="c578192a-6448-4799-ac7a-946fede4b1fa">
    <name>РабочийУчасток</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="89cd1a11-c961-49a0-b7ea-67cc67387e68">
    <name>СкладскаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="63f1d0df-8450-40b2-a6bf-26e9a9bc348d">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="00a21d2c-dfa9-40aa-938f-3fe890533f41">
    <name>ПорядокДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="96ee5655-e55c-4d9d-9386-a82e47bcd733">
    <name>ДатаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="07d94e4d-722d-4939-a3da-ba2a3afba256">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="145a504e-53c5-4349-a710-b106ea052174">
    <name>Получатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b4c013e1-f51f-4900-840f-f755e500fa76">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5fb4b5c4-30c2-4b89-82ff-7057477218df">
    <name>Помещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1e82bc85-5efe-473f-a2a6-04b053896ef5">
    <name>ЗонаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6a9f8399-4614-4cb5-ba80-210c90c11e54">
    <name>Приоритет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="49f3e5fd-cf9c-4585-8222-c47ae930e2dd">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5d8985e0-1a5e-4908-ba86-c4b692cd1634">
    <name>Контролер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="47e1733e-b075-4282-944c-d07d96cd86a9">
    <name>ВсегоМест</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="8ee7ff7a-ec43-4840-800d-22245c14dc90">
    <name>РежимПросмотраПоТоварам</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="08a6fc5b-ac14-420f-987d-169c39288bf4">
    <name>ЗаданиеНаПеревозку</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6ac78645-99c6-4dd6-9e7a-1a60a918a880">
    <name>Накладная</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="71e89e4b-8b80-42ba-ad22-143b0015eb7c">
    <name>ЯчейкаПромежуточногоХранения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="29d823c9-7e0c-4440-a6f7-0759575e73ac">
    <name>ПричинаОтказаОтСборки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="488f5004-17e0-4162-b7a3-08a11e08045c">
    <name>Сотрудник</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="389dae2c-5f04-4c10-8555-7103bd0c3f21">
    <name>ОтгружаемыеТовары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="26cd1a83-599c-4cb2-88f4-8da57cd2dfaf">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="0185ac19-4e81-475e-842b-4f1cec88f0d3">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="152a5a3e-8c56-4983-9052-b8b75a6e0d12">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="8666ee78-482b-4c09-9baa-791917648dbd">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c4e6782d-54b8-4614-8549-b94f2af33d1b">
      <name>Действие</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b9cf586a-fbd5-4e5f-a0f7-df3ef40e11d2">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="93ae14aa-f407-4566-96ba-2cbba0eadcc2">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="fc35a8ee-3531-4b7e-8222-611bb0bc88ab">
      <name>УпаковочныйЛист</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="40dd6af6-2e66-4e56-b31e-687455807ff2">
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="628b3ce2-4791-489a-9690-8cc51d7f27c4">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="f93cbc89-602b-4c37-a90c-1bceda80afe7">
    <name>ТоварыПоРаспоряжениям</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="83f29f84-a577-47ce-933a-46184309914f">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="83b872e0-168f-4cbc-b791-68c2edf79de4">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="cd7cf0b2-0078-4dfa-b137-5418e69d7024">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="8e2e117e-50d4-46cf-9e08-ea6f475d1cca">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="07df2cb8-3a48-4671-b17f-d2bf82e412f8">
      <name>Распоряжение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ae04c7e3-73f4-4a07-bef6-baf69fcb4dfc">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="71ec9ff7-b367-4f30-a98e-368c90e6ac5f">
    <name>ШтрихкодыУпаковок</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="92946722-2614-4655-8fe5-999f3c499fd0">
      <name>ШтрихкодУпаковки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/AccumulationRegisters/ТоварыКОтгрузкеПоНакладным/ТоварыКОтгрузкеПоНакладным.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="a7c328ab-741c-45d7-9358-9e9e38812c91">
  <name>ТоварыКОтгрузкеПоНакладным</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="0cf14db5-9afb-4948-b11a-12138b0ee922">
    <name>КОтгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="bbd1900a-29a4-445d-9f1c-ea3775c0e9f6">
    <name>КСборке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="4b452df3-7133-4e55-9036-8fcfa449831c">
    <name>Собирается</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="0d983be1-230e-4f78-b0a8-b1da22c6cb48">
    <name>Собрано</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="d496068a-6125-46e9-8c4b-05cd1c0ebd11">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="06f44b51-790f-402b-9322-670f9278520e">
    <name>РабочийУчасток</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="1916584f-206a-41b2-8d56-0f3e368caef4">
    <name>Накладная</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="dfd24a1b-5813-48ea-8c9e-ceac25d8ae40">
    <name>Заказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="6d6ffb46-19b4-45e8-a9f2-317588d2d551">
    <name>Получатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="2c217449-34f6-457d-9a2c-d3442baf5298">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="b3f9ea49-88ab-453f-b366-123391ee455c">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="67f3c52a-2cbe-4ad5-b58c-0612ecf33693">
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="609a7d44-d519-40cc-8ec3-a39f9057fb03">
    <name>Серия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

trade_exp/src/InformationRegisters/РазмещениеНоменклатурыПоСкладскимЯчейкам/РазмещениеНоменклатурыПоСкладскимЯчейкам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>РазмещениеНоменклатурыПоСкладскимЯчейкам</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>ОсновнаяЯчейка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Ячейка</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="7150e659-c510-45e5-9deb-fddf7441e996">
    <name>Помещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Enums/СтатусыРасходныхОрдеров/СтатусыРасходныхОрдеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="d873fb7c-bffd-4ee5-9885-25af6032a41f">
  <name>СтатусыРасходныхОрдеров</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="5394523f-1d18-4bb7-94ac-c5f9ed62888e">
    <name>КОтбору</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="2fcc0b73-2f07-413e-aa8c-c99b38f0655b">
    <name>Подготовлен</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="9a7f17cc-0bed-409a-bf22-547957e4b4a3">
    <name>КПроверке</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="92258e4f-ec60-44a5-9ef6-60af9d22d0f4">
    <name>ВПроцессеПроверки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="47a95af3-e94f-43dd-b105-b0009956fe02">
    <name>КОтгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="bdc2dd3b-b02c-4815-af56-2538b334fbf4">
    <name>Отгружен</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Documents/РасходныйОрдерНаТовары/Forms/ФормаДокумента/Module.bsl
#Область Доработки_по_ордерной_схеме

&НаСервере
&ИзменениеИКонтроль("ЗаполнитьПоРаспоряжению")
Процедура Док_ЗаполнитьПоРаспоряжению()
	
	#Вставка
		Если Не ЗначениеЗаполнено(Объект.Накладная) Тогда
			ОбщегоНазначения.СообщитьПользователю("Необходимо указать накладную!");
			Возврат;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.РабочийУчасток) Тогда
			ОбщегоНазначения.СообщитьПользователю("Необходимо указать рабочий участок!");
			Возврат;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
			ОбщегоНазначения.СообщитьПользователю("Необходимо сначала записать документ!");
			Возврат;
		КонецЕсли;
		
		ЗаполнитьПоНакладной();
	#КонецВставки
	
	#Удаление
	Документы.РасходныйОрдерНаТовары.ЗаполнитьОтгружаемыеТоварыПоТоварамПоРаспоряжениям(Объект); 
	РасходныйОрдерНаТоварыЛокализация.УстановитьПризнакИспользованияМаркируемойПродукции(ЭтотОбъект);
	УстановитьВидимостьЭлементовУпаковкиПриМаркировке();
	
	УпаковочныеЛистыСервер.ПриЧтенииСозданииФормыСУпаковочнымиЛистами(ЭтотОбъект,
																Объект.ОтгружаемыеТовары,
																Объект.Ссылка.Метаданные().ПредставлениеОбъекта);
	#КонецУдаления   
	
	ЗаполнитьСлужебныеРеквизитыТЧТовары("ОтгружаемыеТовары", Истина);
	НоменклатураСервер.ЗаполнитьСерииПоFEFO(Объект,ПараметрыУказанияСерий.ОтгружаемыеТовары, Ложь);	
	
	#Удаление
	Если Не СкладыСервер.ИспользоватьАдресноеХранение(Объект.Склад, Объект.Помещение, Объект.ДатаОтгрузки)
		И ПолучитьФункциональнуюОпцию("ИспользоватьУпаковкиНоменклатуры") Тогда
		Документы.РасходныйОрдерНаТовары.РазбитьПоУпаковкамСправочно(Объект);
	КонецЕсли;
	#КонецУдаления

	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект,ПараметрыУказанияСерий.ОтгружаемыеТовары);
	
	ОтобразитьИнформациюПоНеотгружаемымТоварам();
	
	ЗаполнитьСлужебныеРеквизитыТЧТовары("ОтгружаемыеТовары", Ложь);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоНакладной()
	
	Объект.ОтгружаемыеТовары.Очистить();
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСтатусыРасходныхОрдеров", Новый Структура("Склад", Объект.Склад)) Тогда
		Действие = Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку.Отобрать;
	Иначе
		Действие = Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку.Отгрузить;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыКОтгрузкеПоНакладным.Регистратор КАК Регистратор,
		|	ТоварыКОтгрузкеПоНакладным.Накладная КАК Накладная,
		|	ТоварыКОтгрузкеПоНакладным.Номенклатура КАК Номенклатура,
		|	ТоварыКОтгрузкеПоНакладным.Характеристика КАК Характеристика,
		|	ТоварыКОтгрузкеПоНакладным.Назначение КАК Назначение,
		|	ТоварыКОтгрузкеПоНакладным.Серия КАК Серия,
		|	СУММА(ТоварыКОтгрузкеПоНакладным.КОтгрузке + ТоварыКОтгрузкеПоНакладным.КСборке + ТоварыКОтгрузкеПоНакладным.Собирается + ТоварыКОтгрузкеПоНакладным.Собрано) КАК Количество
		|ПОМЕСТИТЬ ВТДанные
		|ИЗ
		|	РегистрНакопления.ТоварыКОтгрузкеПоНакладным КАК ТоварыКОтгрузкеПоНакладным
		|ГДЕ
		|	ТоварыКОтгрузкеПоНакладным.РабочийУчасток = &РабочийУчасток
		|	И ТоварыКОтгрузкеПоНакладным.Накладная = &Накладная
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыКОтгрузкеПоНакладным.Регистратор,
		|	ТоварыКОтгрузкеПоНакладным.Накладная,
		|	ТоварыКОтгрузкеПоНакладным.Номенклатура,
		|	ТоварыКОтгрузкеПоНакладным.Характеристика,
		|	ТоварыКОтгрузкеПоНакладным.Назначение,
		|	ТоварыКОтгрузкеПоНакладным.Серия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Данные.Номенклатура КАК Номенклатура,
		|	Данные.Характеристика КАК Характеристика,
		|	Данные.Назначение КАК Назначение,
		|	Данные.Серия КАК Серия
		|ПОМЕСТИТЬ ВТДанныеПоДругимРасходнымОрдерам
		|ИЗ
		|	ВТДанные КАК Данные
		|ГДЕ
		|	Данные.Регистратор <> &Накладная
		|	И Данные.Регистратор <> &ТекущийРасходныйОрдерНаТовары
		|	И Данные.Регистратор ССЫЛКА Документ.РасходныйОрдерНаТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Данные.Номенклатура КАК Номенклатура,
		|	Данные.Характеристика КАК Характеристика,
		|	Данные.Назначение КАК Назначение,
		|	Данные.Серия КАК Серия,
		|	Данные.Количество КАК Количество
		|ИЗ
		|	ВТДанные КАК Данные
		|ГДЕ
		|	Данные.Регистратор = &Накладная
		|	И НЕ (Данные.Номенклатура, Данные.Характеристика, Данные.Назначение, Данные.Серия) В
		|				(ВЫБРАТЬ
		|					ВТДанныеПоДругимРасходнымОрдерам.Номенклатура,
		|					ВТДанныеПоДругимРасходнымОрдерам.Характеристика,
		|					ВТДанныеПоДругимРасходнымОрдерам.Назначение,
		|					ВТДанныеПоДругимРасходнымОрдерам.Серия
		|				ИЗ
		|					ВТДанныеПоДругимРасходнымОрдерам)";
	
	Запрос.УстановитьПараметр("Накладная", Объект.Накладная);
	Запрос.УстановитьПараметр("РабочийУчасток", Объект.РабочийУчасток);
	Запрос.УстановитьПараметр("ТекущийРасходныйОрдерНаТовары", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Пока РезультатЗапроса.Следующий() Цикл
		НоваяСтрока = Объект.ОтгружаемыеТовары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, РезультатЗапроса);
		
		НоваяСтрока.КоличествоУпаковок = РезультатЗапроса.Количество;
		НоваяСтрока.Действие = Действие;
	КонецЦикла;
	
	Объект.ВсегоМест = УпаковочныеЛистыСервер.КоличествоМестВТЧ(Объект.ОтгружаемыеТовары);

КонецПроцедуры

&НаСервере
Процедура Док_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Элементы.ТоварыПоРаспоряжениям.Видимость = РольДоступна("ПолныеПрава");

	Если Объект.СкладскаяОперация = Перечисления.СкладскиеОперации.ОтгрузкаПоПеремещению Тогда
		_НомерВерсииПеремещения = ПолучитьНомерВерсииПеремещения();
	КонецЕсли; 
	
	ОграничитьДоступность();  
	
	Если ОбменУТМПСервер.ОрдерЗаполнялсяВМП(Объект.Ссылка, Объект.Накладная) Тогда
		Элементы.ОтгружаемыеТоварыЗаполнитьПоРегиструМП.Видимость = Истина;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура Док_ПередЗаписьюНаСервереПеред(Отказ, ТекущийОбъект, ПараметрыЗаписи)
КонецПроцедуры

&НаСервере
Процедура Док_ПослеЗаписиНаСервереПосле(ТекущийОбъект, ПараметрыЗаписи)
КонецПроцедуры

&НаСервере
Процедура ОграничитьДоступность()       
	
	Если РольДоступна("МенеджерТорговогоЗала") Или РольДоступна("СотрудникМД") Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
		// Расширяемые элементы
		Элементы.ПроверитьКоличество.Доступность = Ложь;
		Элементы.ИсправитьКоличество.Доступность = Ложь;
		Элементы.ТоварыПоРаспоряжениямПерезаполнитьОтгружаемымиТоварами.Доступность = Ложь;
		Элементы.ТипОтгрузки.Доступность = Ложь;
	КонецЕсли; 
	
КонецПроцедуры	

&НаКлиенте
Процедура Док_ОтгружаемыеТоварыПриИзмененииПосле(Элемент)
	 ПерезаполнитьОтгружаемымиТоварамиСервер();
	 ОчиститьСообщения();
КонецПроцедуры

&НаКлиенте
Процедура Расш1__КПроверкеПосле(Команда)
	Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыРасходныхОрдеров.КПроверке");
	СтатусПриИзменении(Неопределено);
	ОбщегоНазначенияУТКлиент.Провести(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура Расш1__НачатьСборкуПосле(Команда)
	Объект.Статус =ПредопределенноеЗначение("Перечисление.СтатусыРасходныхОрдеров.КОтбору"); 
	СтатусПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура Расш1__ОтгрузитьПосле(Команда)
	Объект.Статус =  ПредопределенноеЗначение("Перечисление.СтатусыРасходныхОрдеров.Отгружен");
	СтатусПриИзменении(Неопределено); 
	ОбщегоНазначенияУТКлиент.Провести(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура Расш1__СобраноПосле(Команда)
	Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыРасходныхОрдеров.КОтгрузке");
	СтатусПриИзменении(Неопределено);
КонецПроцедуры

&НаСервере
Процедура СортировкаПоЯчейке()
	
	Если Объект.ОтгружаемыеТовары.Количество()>0 Тогда
		
		Запрос = Новый Запрос;
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	ВнешняяТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
					|	ВнешняяТаблицаНоменклатуры.Характеристика КАК Характеристика,
					|	ВнешняяТаблицаНоменклатуры.Назначение КАК Назначение,
					|	ВнешняяТаблицаНоменклатуры.Упаковка КАК Упаковка,
					|	ВнешняяТаблицаНоменклатуры.КоличествоУпаковок КАК КоличествоУпаковок,
					|	ВнешняяТаблицаНоменклатуры.Количество КАК Количество,
					|	ВнешняяТаблицаНоменклатуры.СтатусУказанияСерий КАК СтатусУказанияСерий,
					|	ВнешняяТаблицаНоменклатуры.Действие КАК Действие,
					|	ВнешняяТаблицаНоменклатуры.УпаковочныйЛист КАК УпаковочныйЛист,
					|	ВнешняяТаблицаНоменклатуры.УпаковочныйЛистРодитель КАК УпаковочныйЛистРодитель,
					|	ВнешняяТаблицаНоменклатуры.ЭтоУпаковочныйЛист КАК ЭтоУпаковочныйЛист,
					|	ВнешняяТаблицаНоменклатуры.ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста КАК ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста,
					|	ВнешняяТаблицаНоменклатуры.Серия КАК Серия
					|ПОМЕСТИТЬ ВнешняяТаблицаНоменклатуры
					|ИЗ
					|	&ВнешняяТаблицаНоменклатуры КАК ВнешняяТаблицаНоменклатуры
					|
					|ИНДЕКСИРОВАТЬ ПО
					|	Номенклатура
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ВнешняяТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
					|	ВнешняяТаблицаНоменклатуры.Характеристика КАК Характеристика,
					|	ВнешняяТаблицаНоменклатуры.Количество КАК Количество,
					|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка КАК Ячейка,
					|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.Наименование КАК ЯчейкаНаименование,
					|	ВнешняяТаблицаНоменклатуры.Назначение КАК Назначение,
					|	ВнешняяТаблицаНоменклатуры.Упаковка КАК Упаковка,
					|	ВнешняяТаблицаНоменклатуры.КоличествоУпаковок КАК КоличествоУпаковок,
					|	ВнешняяТаблицаНоменклатуры.СтатусУказанияСерий КАК СтатусУказанияСерий,
					|	ВнешняяТаблицаНоменклатуры.Действие КАК Действие,
					|	ВнешняяТаблицаНоменклатуры.УпаковочныйЛист КАК УпаковочныйЛист,
					|	ВнешняяТаблицаНоменклатуры.УпаковочныйЛистРодитель КАК УпаковочныйЛистРодитель,
					|	ВнешняяТаблицаНоменклатуры.ЭтоУпаковочныйЛист КАК ЭтоУпаковочныйЛист,
					|	ВнешняяТаблицаНоменклатуры.ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста КАК ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста,
					|	ВнешняяТаблицаНоменклатуры.Серия КАК Серия
					|ИЗ
					|	ВнешняяТаблицаНоменклатуры КАК ВнешняяТаблицаНоменклатуры
					|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
					|		ПО ВнешняяТаблицаНоменклатуры.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
					|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад = &Склад)
					|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА)
					|
					|УПОРЯДОЧИТЬ ПО
					|	ЯчейкаНаименование";
					
					Запрос.УстановитьПараметр("ВнешняяТаблицаНоменклатуры",Объект.ОтгружаемыеТовары.Выгрузить());
					Запрос.УстановитьПараметр("Склад",Объект.Склад);
					
					Объект.ОтгружаемыеТовары.Очистить();
					Объект.ОтгружаемыеТовары.Загрузить(Запрос.Выполнить().Выгрузить());

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Док__СортировкаПоЯчейкеПосле(Команда)
	СортировкаПоЯчейке();
КонецПроцедуры

Функция ПолучитьНомерВерсииПеремещения()
	Возврат АльтерраОбщегоНазначения.ПолучитьКоличествоЗаписейВРегистреСобытияДокументов(ПолучитьПеремещениеПоЗаказам(),Перечисления.СобытияДокументов.ИзменениеТабличнойЧасти);
КонецФункции

Функция ПолучитьПеремещениеПоЗаказам()
	
	СсылкаНаПеремещение = Документы.ПеремещениеТоваров.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение КАК Распоряжение
		|ПОМЕСТИТЬ ВТ_Распоряжения
		|ИЗ
		|	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
		|ГДЕ
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПеремещениеТоваровТовары.Ссылка КАК Ссылка
		|ИЗ
		|	ВТ_Распоряжения КАК ВТ_Распоряжения
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
		|		ПО (ПеремещениеТоваровТовары.Ссылка = ВТ_Распоряжения.Распоряжение
		|				ИЛИ ПеремещениеТоваровТовары.ЗаказНаПеремещение = ВТ_Распоряжения.Распоряжение)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПеремещениеТоваровТовары.Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СсылкаНаПеремещение = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат СсылкаНаПеремещение;
КонецФункции

&НаКлиенте
Процедура Док_ПриОткрытииПосле(Отказ)
	ПосчитатьИтогПоВесу();
КонецПроцедуры

&НаКлиенте
Процедура Док_ОтгружаемыеТоварыКоличествоУпаковокПриИзмененииПосле(Элемент)
	ПосчитатьИтогПоВесу();
КонецПроцедуры

&НаКлиенте
Процедура ПосчитатьИтогПоВесу()
	
	ВесВсего = 0;
    
    Для Каждого Строка Из Объект.ОтгружаемыеТовары Цикл
		//Если Элементы.ОтгружаемыеТовары.ПроверитьСтроку(Строка) тогда
            ВесВсего = ВесВсего+Строка.Вес;
		//КонецЕсли;  
	КонецЦикла;
	
    Элементы.ОтгружаемыеТоварыВес.ТекстПодвала = ВесВсего;
	
КонецПроцедуры

#КонецОбласти   

#Область ИнициализацияЯПХ

&НаКлиенте
Процедура ЯчейкаПромежуточногоХраненияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыОткрытияФормы = ПараметрыОткрытияФормы_СкладскиеЯчейки(СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда
		СтандартнаяОбработка = Ложь;
	Иначе
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Справочник.СкладскиеЯчейки.Форма.ФормаВыбора", 
		ПараметрыОткрытияФормы,
		ЭтаФорма, 
		, 
		, 
		,
		Новый ОписаниеОповещения("ЯчейкаПромежуточногоХраненияНачалоВыбора_Завершение", ЭтаФорма), 
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);   
				
КонецПроцедуры        
	
&НаКлиенте
Процедура ЯчейкаПромежуточногоХраненияНачалоВыбора_Завершение(НовоеЗначение, ДополнительныеПараметры) Экспорт
	Если НовоеЗначение <> Неопределено Тогда
		Объект.ЯчейкаПромежуточногоХранения = НовоеЗначение;
		Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыРасходныхОрдеров.КОтгрузке");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПараметрыОткрытияФормы_СкладскиеЯчейки(СтандартнаяОбработка)     
	
	СекцииСотрудника = Справочники.Сотрудники.НайтиПоРеквизиту("Пользователь", Пользователи.ТекущийПользователь()).РабочиеУчастки.ВыгрузитьКолонку("РабочийУчасток");
	
	МассивСсылокИерархия = Новый Массив;     
	РабочийУчасток = Справочники.РабочиеУчастки.ПустаяСсылка();         
	
	Если СекцииСотрудника.Количество() > 0 Тогда
		Для Каждого Строка Из СекцииСотрудника.ВыгрузитьЗначения() Цикл
			МассивСсылокИерархия.Добавить(Строка.ГруппаСкладскихЯчеекХраненияПриОтгрузке);		
		КонецЦикла;                   
	ИначеЕсли ЗначениеЗаполнено(Объект.РабочийУчасток) Тогда
		Если ЗначениеЗаполнено(Объект.РабочийУчасток.ГруппаСкладскихЯчеекХраненияПриОтгрузке) Тогда
			МассивСсылокИерархия.Добавить(Объект.РабочийУчасток.ГруппаСкладскихЯчеекХраненияПриОтгрузке);
		Иначе       
			РабочиеУчастки = Объект.РабочийУчасток;
		КонецЕсли;	  
	Иначе
		СтандартнаяОбработка = Ложь;
		ОбщегоНазначения.СообщитьПользователю("Необходимо сначала указать рабочий участок!");
	КонецЕсли;  
	
	Возврат Новый Структура("МассивСсылокИерархия, РабочийУчасток", МассивСсылокИерархия, РабочийУчасток);

КонецФункции 

#КонецОбласти

&НаКлиенте
Процедура Док_ПередЗаписьюПеред(Отказ, ПараметрыЗаписи)
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		СФП_МаркерыКлиент.МаркерНачало("Расходный ордер на товары: проведение из формы", Объект.Номер);
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция Док_ЗаполнитьПоРегиструМППослеНаСервере(Отработаные) 
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	БылиИзменения = ОбменУТМПСервер.ЗаполнитьОрдер(ДокОбъект, "ОтгружаемыеТовары", Отработаные); 
	ЗначениеВРеквизитФормы(ДокОбъект, "Объект"); 
	Возврат БылиИзменения;
КонецФункции

&НаКлиенте
Процедура Док_ЗаполнитьПоРегиструМППосле(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьОтветЗаполнениеПоРегистру", ЭтаФорма);
	ТекстВопроса = "Дозаполнить только необработанные строки?";
   	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
КонецПроцедуры 

&НаКлиенте
Процедура ОбработатьОтветЗаполнениеПоРегистру(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		Отработаные = Ложь;
	Иначе
		Отработаные = Истина;	
	КонецЕсли;
	БылиИзменения = Док_ЗаполнитьПоРегиструМППослеНаСервере(Отработаные);
	Если БылиИзменения Тогда
		ЭтаФорма.Модифицированность = Истина;
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьОтветОчисткаПустыхСтрок", ЭтаФорма);
		ТекстВопроса = "Очистить неотработанные строки?";
	   	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура ОбработатьОтветОчисткаПустыхСтрок(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОбработатьОтветОчисткаПустыхСтрокНаСервере();
	КонецЕсли;	 	
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьОтветОчисткаПустыхСтрокНаСервере() 
	
	МассивСтрок = Объект.ОтгружаемыеТовары.НайтиСтроки(Новый Структура("КоличествоУпаковок",0));
	Для Каждого Строка Из МассивСтрок Цикл
		Объект.ОтгружаемыеТовары.Удалить(Строка);
	КонецЦикла;	
	ПерезаполнитьОтгружаемымиТоварамиСервер();
	
КонецПроцедуры
